{"/blogs/cdg-github-stat-tracker/":{"data":{"building-the-github-stat-tracker#Building the GitHub Stat Tracker":"","conclusion-the-power-of-play-in-professional-development#Conclusion: The Power of Play in Professional Development":"The Compass Digital Group GitHub Stat Tracker stands as proof that work doesn’t have to feel like work. By introducing game mechanics into our development process, we’ve created a more engaging, productive, and collaborative environment.\nIn just four hours, we built something that continues to deliver value months later. But more importantly, we learned that the best productivity tools aren’t always the most sophisticated – sometimes they’re the ones that make people excited to contribute.\nReady to gamify your own development workflow? Connect with us to learn more about implementing GitHub webhook-based stat tracking for your team.","lessons-learned-what-wed-do-differently#Lessons Learned: What We\u0026rsquo;d Do Differently":"","monthly-leaderboards-the-game-changer#Monthly Leaderboards: The Game Changer":"","technical-deep-dive-the-magic-behind-the-scenes#Technical Deep Dive: The Magic Behind the Scenes":"","the-challenge-a-4-hour-innovation-sprint#The Challenge: A 4-Hour Innovation Sprint":"","the-eureka-moment-gamifying-github#The Eureka Moment: Gamifying GitHub":"","the-hackathons-lasting-legacy#The Hackathon\u0026rsquo;s Lasting Legacy":"Turning Code Commits into Epic Quests: Our 4-Hour Hackathon Success StoryWhat happens when you give a group of passionate developers just four hours and complete creative freedom? Magic happens. This year’s Compass Digital Group anniversary celebration proved that some of the best innovations come from tight deadlines and ambitious ideas.\nThe Challenge: A 4-Hour Innovation Sprint Our annual celebration took an exciting turn this year with a hackathon format. The rules were simple: four hours, any technology, any idea. The goal? Create something that could genuinely impact our team’s workflow and productivity.\nWhile other teams explored various directions, Reggie and I found ourselves drawn to a problem we’d been discussing for months: how do we make coding more engaging and track our collective progress in a meaningful way?\nThe Eureka Moment: Gamifying GitHub The idea hit us like lightning: what if we could transform our daily coding activities into a role-playing game? What if every commit, pull request, and code review became a “quest” that awarded experience points?\nWe envisioned a system where:\nCommits became mini-quests worth XP Pull requests were major achievements Code reviews earned collaboration bonuses Monthly leaderboards created friendly competition The concept was ambitious for a four-hour window, but we were determined to make it work.\nBuilding the GitHub Stat Tracker The Technical Architecture Our solution centered around GitHub webhooks – the perfect bridge between our development activities and our gamification system. Here’s how we structured it:\nCore Components:\nWebhook Listener: Captures real-time GitHub events XP Calculator: Assigns points based on activity type and complexity Leaderboard Engine: Tracks monthly rankings and achievements Dashboard Interface: Displays stats, progress, and team standings Racing Against the Clock With only four hours, every decision mattered. We split responsibilities:\nReggie tackled further research, XP calculation and feature ideas I vibe coded the rest The time pressure actually helped us avoid over-engineering. We built exactly what we needed – no more, no less.\nThe Psychology of Gamification What surprised us most wasn’t just the productivity boost – it was how the system changed our team dynamics:\nPositive Competition: Instead of individual silos, we developed a culture of healthy competition mixed with collaboration.\nVisible Progress: Developers could finally see their daily contributions quantified and celebrated.\nRecognition System: Quiet contributors who might not speak up in meetings suddenly had their consistent efforts highlighted.\nMonthly Leaderboards: The Game Changer The monthly leaderboard became our secret weapon. Unlike daily or weekly cycles, the monthly format:\nSustained Motivation: Long enough to matter, short enough to feel achievable Comeback Opportunities: Bad weeks didn’t eliminate entire months Natural Reset: Fresh starts every month kept everyone engaged Technical Deep Dive: The Magic Behind the Scenes Webhook Integration // Simplified webhook handler app.post(\"/github-webhook\", (req, res) =\u003e { const event = req.headers[\"x-github-event\"]; const payload = req.body; switch (event) { case \"push\": awardCommitXP(payload); break; case \"pull_request\": awardPRXP(payload); break; case \"pull_request_review\": awardReviewXP(payload); break; } }); Lessons Learned: What We’d Do Differently The Good Simple deployment: Minimal infrastructure meant quick iteration Real-time feedback: Instant XP awards kept momentum high Team buy-in: Everyone embraced the system from day one The Improvements Anti-gaming measures: Some developers found ways to inflate XP, ahem Owen \u0026 Brian Quality metrics: We need to balance quantity with code quality Team achievements: Individual focus sometimes overshadowed collaboration Knowledge Sharing An unexpected benefit emerged: developers started sharing strategies for earning XP, which naturally led to:\nBest practice discussions Code review technique improvements Collaborative problem-solving approaches The Hackathon’s Lasting Legacy What started as a four-hour experiment has become an integral part of our development culture. The GitHub Stat Tracker proves that sometimes the best solutions come from:\nTight constraints that force creative thinking Team collaboration under pressure Willingness to experiment with unconventional approaches ","turning-code-commits-into-epic-quests-our-4-hour-hackathon-success-story#Turning Code Commits into Epic Quests: Our 4-Hour Hackathon Success Story":"","want-to-build-your-own#Want to Build Your Own?":"Inspired to gamify your own development team? Here are our key recommendations:\nStart simple: Basic webhook + XP calculation goes far Get team buy-in: Success depends on participation Iterate quickly: Listen to feedback and adjust rules Balance competition: Ensure healthy rivalry, not toxic behavior Celebrate everyone: Find ways to recognize all contribution styles "},"title":"Gamifying Developer Productivity: How We Built a GitHub Stat Tracker in 4 Hours"},"/blogs/features/custom-event-links/":{"data":{"getting-started#Getting Started":"Head over to your organiser dashboard and look for the “Custom Links” section. Create your first custom link in just a few clicks!\nReady to make your events easier to share? Try Custom Event Links today!\nBuilt with ❤️ by the SPORTSHUB team.","how-it-works#How it Works":"","introducing-custom-event-links-#Introducing \u003cstrong\u003eCustom Event Links\u003c/strong\u003e 🔗":"","perfect-for#Perfect For":" Sports Clubs running weekly sessions Event Organizers with regular tournaments Anyone who wants a professional, permanent event link ","what-are-custom-event-links#What are Custom Event Links?":"","why-youll-love-it#Why You\u0026rsquo;ll Love It":"\nIntroducing Custom Event Links 🔗We’re excited to announce our latest feature that’s going to make sharing your events easier than ever! Say hello to Custom Event Links - your new best friend for seamless event promotion.\nWhat are Custom Event Links? Custom Event Links allow you to create a permanent, branded URL on SPORTSHUB that you can share anywhere - social media, emails, business cards, you name it! The best part? These links are smart - they automatically update to point to your latest event in your recurring event series.\nHow it Works ⭐ For Single Events Create a custom link like sportshub.net.au/event/username/your-brand that points directly to your event. Perfect for one-off tournaments, recurring workshops, or special events.\n🗓️ For Recurring Events Set up a custom link that automatically updates to your next recurring event. No more broken links or manual updates - your link stays fresh and always points to the current event in your series.\nWhy You’ll Love It 🎯 Brand Consistency: Keep your links clean and professional ⚡ Always Current: Links automatically update for recurring events 📱 Share Anywhere: Works on all platforms and devices 🔄 Zero Maintenance: Set it once, forget about it "},"title":"[Feature] Custom Event Links"},"/blogs/introducing-sportshub-blogs/":{"data":{"built-on-hugo-fast-flexible-and-fun#Built on HUGO: Fast, Flexible, and Fun":"","meet-hextra-our-theme-of-choice#Meet Hextra: Our Theme of Choice":"","welcome-to-the-brand-new-sportshub-blogs-#Welcome to the brand new \u003cstrong\u003eSPORTSHUB Blogs\u003c/strong\u003e! 🎉":"","whats-next#What\u0026rsquo;s Next?":"\nWelcome to the brand new SPORTSHUB Blogs! 🎉We’re super excited to launch this space where we’ll be sharing all the latest and greatest from the SPORTSHUB team.\nExpect a mix of feature release announcements, deep dives into our engineering adventures, and maybe even a few behind-the-scenes stories (with memes, if we’re feeling brave).\nWhy a Blog? We believe in building in the open and sharing what we learn. Whether it’s a shiny new feature, a tricky bug we squashed, or a cool hack that made our lives easier, we want you to be part of the journey. Plus, who doesn’t love a good blog post with some code snippets and GIFs?\nBuilt on HUGO: Fast, Flexible, and Fun Our blog is powered by HUGO, the industry standard and fastest static site generator out there. Seriously, it’s blazing fast—Hugo can build thousands of pages in seconds. Some fun facts:\n🚀 Speed Demon: Hugo is written in Go and can generate sites in milliseconds. 🏆 Industry Standard: Used by companies like DigitalOcean, Cloudflare, and many more. 🛠️ Markdown Magic: Write in Markdown, publish in style. Want to geek out more? Check out Hugo’s official site.\nWe opted with a this pre-built framework route as we want to keep our blog maintenance overhead to a minimum. Seeing we are only a team of 6 engineers, we want to prioritize our time developing features on SPORTSHUB, rather than building our blog site from scratch and having to cop maintenance overhead of a custom solution.\nThe Architecture: Simple, Robust, Scalable Here’s a peek under the hood:\nContent: All our posts (like this one!) are written in Markdown and live in our GitHub repo. Build: Hugo takes care of turning Markdown into beautiful, static HTML. Deploy: We push to GitHub, and our CI/CD pipeline takes care of the rest—no manual deploys, no fuss. Fast Delivery: Static sites mean lightning-fast load times and rock-solid reliability. Meet Hextra: Our Theme of Choice We wanted our blog to look as good as it reads, so we picked the Hextra theme for Hugo. It’s modern, clean, and super customizable. Plus, it comes with all the bells and whistles:\n🌈 Beautiful design out of the box 📱 Fully responsive (read us on your phone, tablet, or fridge) 🧩 Easy to extend and tweak What’s Next? Feature Announcements: Stay tuned for updates on new releases and improvements. Engineering Blogs: Deep dives, architecture decisions, and lessons learned. Community Spotlights: We love our users—maybe you’ll see your story here! Thanks for stopping by! If you have ideas, feedback, or just want to say hi, reach out to us or drop a comment below. Happy reading!\nBuilt with ❤️ by the SPORTSHUB team, powered by Hugo and Hextra.","why-a-blog#Why a Blog?":""},"title":"Introducing SPORTSHUB Blogs"}}